roam/public_html/20260126161220-regex.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-15 Sun 16:51 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Regex</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/custom.css" />

</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Regex</h1>
</header><p>
Regex will arbitrarily match pattern in a line unless pinned to a location.
Any meta-character to be used literally must be escaped with a '\' prepending it.
Generally find what excludes the bad case.
</p>

<p>
Groups can be nested.
Groups will only capture what is enclosed in '()'.
Groups can typically be referenced with '\\d+' (like '\0' or '\1').
Groups are referenced from '\1' onwards; '\0' is the whole matched string.
</p>

<p>
'|' can decide what to OR a little arbitrarily. Maybe on whitespace as well as group?
All set matchers (like '\d') can be inversed through capitalization.
</p>

<p>
Flags can be combined like '(?im)'.
</p>

<p>
'\d' will match any digit [0-9].
'\w' will match any alphanumeric [A-Za-z0-9_].
'\s' will match any whitespace.
</p>

<p>
'[]' encapsulating a collection of characters indicates an OR.
'-' can be used inside '[]' to indicate a sequential range of values to be represented.
'{}' can be appended to a character to indicate number of instances to match.
',' can be used in some engines inside '{}' to designate a range.
'()' will capture characters match in a group for later use.
'?:' inside '()' will result in a non-capturing group.
</p>

<p>
'^' is a meta-character IN '[] for NOT.
'^' is a meta-character OUTSIDE of '[] for start of line.
'$' is a meta-character for end of line.
'\b' is a boundary between alphanumeric and non-alphanumeric character.
</p>

<p>
'.' is a meta-character for literally anything.
'<b>' is a meta-character for 0 or more matches.
'+' is a meta-character for 1 or more matches.
'?' after QUANTIER ('</b>', '+','{,}') is a meta-character for laziness.
'?' after REGULAR CHARACTER/TOKEN is a meta-character for optionality.
'|' indicates an OR for the whole sequence.
</p>

<p>
'(?i)' flag for case-insensitive.
'(?m)' flag for multiline (^ and $ match line boundaries).
'(?s)' flag for dotall, making '.' match newlines.
</p>
</div>
</body>
</html>
